import TextBlock from "./TextBlock.vue";

export default {
  title: "pages/Quality/ui/TextBlock",
  component: TextBlock,
  parameters: {
    backgrounds: {
      default: "dark",
    },
  },
};

export const textBlock = (args) => ({
  components: {
    TextBlock,
  },
  setup() {
    return { args };
  },
  template: `
    <div style="background-color: white; width: 408px">
     <TextBlock title="Идея">
        <template v-slot:number>
          <svg width="131" height="76" viewBox="0 0 131 76" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M32 44C49 44 86 39 99 32" stroke="#FFF8E5" stroke-width="63" stroke-linecap="round"/>
            <path d="M51.816 31.064L63.4 23.576C64.3813 22.9787 65.256 22.872 66.024 23.256C66.8347 23.64 67.2827 24.3867 67.368 25.496C67.88 31.2987 67.9867 36.3973 67.688 40.792C67.3893 45.1867 66.8133 49.2827 65.96 53.08C65.7893 53.8907 65.384 54.4453 64.744 54.744C64.1467 55.0427 63.528 55.128 62.888 55C62.248 54.872 61.7147 54.5307 61.288 53.976C60.904 53.4213 60.7973 52.7387 60.968 51.928C61.224 50.7333 61.48 49.2827 61.736 47.576C62.0347 45.8693 62.2693 44.0347 62.44 42.072C62.6107 40.1093 62.7173 38.104 62.76 36.056C62.8027 34.008 62.7387 32.0667 62.568 30.232L54.632 35.416C53.9067 35.8853 53.224 36.0133 52.584 35.8C51.944 35.544 51.432 35.16 51.048 34.648C50.7067 34.0933 50.5573 33.4747 50.6 32.792C50.6853 32.1093 51.0907 31.5333 51.816 31.064Z" fill="#FFC124"/>
          </svg>
        </template>
       <template v-slot:text>
         Продукт должен соответствовать актуальным требованиям рынка, но творческие аспекты очень быстро выходят на первый план. Мы представляем ребенка, который будет играть в Харди Гарди. Думаем о возрасте малыша, где и как он сможет играть, чем игра будет для него интересна и полезна, и какие навыки и знания ребёнок приобретёт.
       </template>
     </TextBlock>
    </div>
  `,
  methods: {},
});
